tests/load/artillery/realtime-acceptance.yml
config:
  target: "{{ $env.BASE_URL }}"
  processor: "./processor.cjs"
  phases:
    - name: ramp-1000-sockets-over-5m
      duration: 300
      arrivalCount: 1000
      maxVusers: 1000
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "{{ $env.ARTILLERY_PUSHGATEWAY_URL }}"
        prefix: orbit_load_test
        tags:
          - "scenario:audience-revision"
    ensure:
      thresholds:
        - "orbit_http_submit_ms.p95": 1000
        - "orbit_revision_event_ms.p95": 1000
      conditions:
        - expression: "vusers.failed == 0"
          strict: true
before:
  flow:
    - function: assertSafety
scenarios:
  - name: audience-revision-acceptance
    flow:
      - function: runRealtimeScenario