tests/load/artillery/realtime-load.yml
config:
  target: "{{ $env.BASE_URL }}"
  processor: "./processor.cjs"
  phases:
    - name: ramp-100-sockets-over-2m
      duration: 120
      arrivalCount: 100
      maxVusers: 100
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "{{ $env.ARTILLERY_PUSHGATEWAY_URL }}"
        prefix: orbit_load_test
        tags:
          - "scenario:audience-revision-load"
    ensure:
      thresholds:
        - "orbit_http_submit_ms.p95": 1000
        - "orbit_revision_event_ms.p95": 1000
      conditions:
        - expression: "vusers.failed == 0"
          strict: true
before:
  flow:
    - function: assertSafety
scenarios:
  - name: audience-revision-load
    flow:
      - function: runRealtimeScenario